## Plan Result (stg-backendappgateway)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
  * module.backendappgateway.azurerm_public_ip.app_gw[0]
  * module.backendappgateway.azurerm_public_ip.app_gw[1]
  * module.backendappgateway.azurerm_role_assignment.identity
  * module.backendappgateway.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks00-aat-agw"
      + resource_group_name = "cft-aat-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "draft-store-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "cmc-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "rpe-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "rpe-service-auth-provider"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "camunda-bpm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "camunda-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "probate-back-office"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-case-notifications-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-case-documents-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-aip-frontend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-home-office-integration-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-home-office-mock-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-timed-event-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-case-payments-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "pcq-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "lau-case-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "lau-idam-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-fps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-dgs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-cms"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-hm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-cfs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "finrem-ns"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "finrem-ps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "finrem-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "finrem-dgcs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "finrem-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-tribunals-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-bulk-scan"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-ccd-callback-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "fpl-case-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "adoption-cos-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ethos-repl-docmosis-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ethos-ecm-consumer"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "am-accessmgmt-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "am-role-assignment-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "am-judicial-booking-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "am-org-role-mapping-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-anno"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-npa"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-stitching"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-ccd-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-showcase"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-icp"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-hrs-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "em-hrs-ingestor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "dg-docassembly"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "dm-store"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "dm-store-staging"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "bulk-scan-payment-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "bulk-scan-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "bulk-scan-sample-app"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "bulk-scan-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "reform-scan-notification-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-data-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-definition-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-test-stubs-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-case-print-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-case-activity-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-admin-web"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-case-document-am-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ccd-message-publisher"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "aac-manage-case-assignment"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ctsc-work-allocation"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-terms-and-conditions"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-activity-tracker-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
          

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ath_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya-api"
          + id                         = (known after apply)
          + name                       = "et-sya-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-bulk-scan-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-bulk-scan-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-bulk-scan-api"
          + id                         = (known after apply)
          + name                       = "fis-bulk-scan-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-cos-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-cos-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-cos-api"
          + id                         = (known after apply)
          + name                       = "fis-cos-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fprl-cos"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fprl-cos"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fprl-cos"
          + id                         = (known after apply)
          + name                       = "fprl-cos"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fprl-dgs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fprl-dgs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fprl-dgs"
          + id                         = (known after apply)
          + name                       = "fprl-dgs"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-cft-hearing-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-cft-hearing-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-cft-hearing-service"
          + id                         = (known after apply)
          + name                       = "hmc-cft-hearing-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-inbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-inbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-inbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-inbound-adapter"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-outbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-outbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-outbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-outbound-adapter"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-bail-case-api"
          + id                         = (known after apply)
          + name                       = "ia-bail-case-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-case-access-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-case-access-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-case-access-api"
          + id                         = (known after apply)
          + name                       = "ia-case-access-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-testing-support-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-testing-support-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-testing-support-api"
          + id                         = (known after apply)
          + name                       = "idam-testing-support-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          [32m+ url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-dashboard"
          + id                         = (known after apply)
          + name                       = "idam-user-dashboard"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum-recipe-backend"
          + id                         = (known after apply)
          + name                       = "plum-recipe-backend"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prl-cos"
          + id                         = (known after apply)
          + name                       = "prl-cos"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prl-dgs"
          + id                         = (known after apply)
          + name                       = "prl-dgs"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpts-api"
          + id                         = (known after apply)
          + name                       = "rpts-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-case-event-handler"
          + id                         = (known after apply)
          + name                       = "wa-case-event-handler"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-task-monitor"
          + id                         = (known after apply)
          + name                       = "wa-task-monitor"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsstg.vault.azure.net/secrets/wildcard-aat-platform-hmcts-net"
          + name                = "wildcard-aat-platform-hmcts-net"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-aks-appgw-aat-pip"
      + resource_group_name     = "cft-aat-network-rg"
      + sku                     = "Standard"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-aks-appgw-aat-pip-1"
      + resource_group_name     = "cft-aat-network-rg"
      + sku                     = "Standard"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.backendappgateway.azurerm_role_assignment.identity will be created
  + resource "azurerm_role_assignment" "identity" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.backendappgateway.azurerm_user_assigned_identity.identity will be created
  + resource "azurerm_user_assigned_identity" "identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks-aat-agw"
      + principal_id        = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + tenant_id           = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1263,"Program":"tfcmt","SHA1":"","Target":"stg-backendappgateway","Vars":{}} -->